let restaurant = [
  {
    img: process.env.PUBLIC_URL + "/images/red.png",
    name: "지하 학생식당",
  },
  {
    img: process.env.PUBLIC_URL + "/images/building.png",
    name: "E동 학생식당",
  },
  {
    img: process.env.PUBLIC_URL + "/images/black.png",
    name: "종합 학생식당",
  },
];

// let restaurant = [
//   {
//     img: URL("../public/images/red.png"),
//     name: "지하 학생식당",
//   },
//   {
//     img: URL(),
//     name: "E동 학생식당",
//   },
//   {
//     img: URL(),
//     name: "종합 학생식당",
//   },
// ];

//지하식당 메뉴
let lunch_under = [
  {
    date: "27",
    day: "월",
    content: [
      "숯불간장불고기",
      "콩나물국",
      "고로케&케찹",
      "파채무침",
      "배추김치",
      "오이샐러드",
    ],
  },
  {
    date: "28",
    day: "화",
    content: ["소세지카레덮밥", "미역국", "두부강정", "깍두기", "양배추샐러드"],
  },
  {
    date: "29",
    day: "수",
    content: [
      "치킨마요덮밥",
      "장국",
      "어묵볶음",
      "무말랭이무침",
      "열무김치",
      "가래떡맛탕",
    ],
  },
  {
    date: "30",
    day: " 목",
    content: ["잔치국수", "흰쌀밥", "깐풍가지", "돈가스", "배추김치", "오복지"],
  },
  {
    date: "31",
    day: "금",
    content: [
      "등촌샤브칼국수",
      "물만두&초간장",
      "고구마맛탕",
      "간장고추지",
      "배추김치",
      "요구르트",
    ],
  },
];

let dinner_under = [
  {
    date: "27",
    day: "월",
    content: [
      "돈육고추장볶음",
      "콩나물무침",
      "들깨무채국",
      "비엔나구이",
      "브로콜리",
      "포기김치",
    ],
  },
  {
    date: "28",
    day: "화",
    content: [
      "어니언치킨",
      "미소국",
      "볶음우동",
      "도토리묵무침",
      "양배추샐러드",
      "깍두기",
    ],
  },
  {
    date: "29",
    day: "수",
    content: [
      "나물비빔밥",
      "김치찌개",
      "고구마맛탕",
      "오복지",
      "열무김치",
      "요구르트",
    ],
  },
  {
    date: "30",
    day: " 목",
    content: [
      "설렁탕&소면",
      "메밀전병",
      "알감자조림",
      "고추쌈장무침",
      "깍두기",
      "사과샐러드",
    ],
  },
  {
    date: "31",
    day: "금",
    content: [
      "미트스파게티",
      "양송이스프",
      "치킨텐더샐러드",
      "피클",
      "깍두기",
      "마늘바게트",
    ],
  },
];

//E동식당 메뉴
let lunch_E = [
  {
    date: "27",
    day: "월",
    content: [
      "들깨무채국",
      "비엔나구이",
      "도토리묵무침",
      "콩나물무침",
      "배추김치",
      "돈육고추장볶음",
    ],
  },
  {
    date: "28",
    day: "화",
    content: ["닭갈비덮밥", "미소국", "만두강정", "단무지", "양배추샐러드"],
  },
  {
    date: "29",
    day: "수",
    content: [
      "새우튀김우동",
      "메밀전병",
      "알감자조림",
      "고추쌈장무침",
      "배추김치",
      "사과샐러드",
    ],
  },
  {
    date: "30",
    day: " 목",
    content: [
      "참치마요덮밥",
      "가쓰오장국",
      "돈육땅콩강정",
      "돈가스",
      "배추김치",
      "요구르트",
    ],
  },
  {
    date: "31",
    day: "금",
    content: [
      "미트소스스파게티",
      "양송이스프",
      "치킨텐더샐러드",
      "피클",
      "깍두기",
      "핫도그",
    ],
  },
];

let dinner_E = [
  {
    date: "27",
    day: "월",
    content: ["베이컨김치볶음밥", "장국", "스크램블에그", "깍두기", "양념감자"],
  },
  {
    date: "28",
    day: "화",
    content: [
      "마파두부덮밥",
      "콩나물국",
      "김말이튀김",
      "배추김치",
      "팬케이크",
      "꿀",
    ],
  },
  {
    date: "29",
    day: "수",
    content: [
      "나물비빔밥",
      "김치찌개",
      "고구마맛탕",
      "오복지",
      "열무김치",
      "요구르트",
    ],
  },
  {
    date: "30",
    day: " 목",
    content: ["열무비빔밥", "미니칼국수", "배추김치", "단호박범벅", "사과"],
  },
  {
    date: "31",
    day: "금",
    content: ["불닭게티", "후리가케양념밥", "미역국", "배추김치", "콘치즈"],
  },
];

//종합식당 메뉴
let lunch_total = [
  {
    date: "27",
    day: "월",
    content: [
      "깐풍군만두",
      "부대찌개",
      "메추리알장조림",
      "편마늘브로콜리볶음",
      "오이생채",
      "깍두기",
    ],
  },
  {
    date: "28",
    day: "화",
    content: ["나물비빔밥", "청국장찌개", "소떡소떡", "오복지", "요구르트"],
  },
  {
    date: "29",
    day: "수",
    content: [
      "닭갈비",
      "순두부백탕",
      "도라지튀김",
      "콩나물겨자냉채",
      "미역줄기볶음",
      "포기김치",
    ],
  },
  {
    date: "30",
    day: " 목",
    content: [
      "함박스테이크",
      "양송이스프",
      "미트소스스파게티",
      "피클",
      "깍두기",
      "그린샐러드",
    ],
  },
  {
    date: "31",
    day: "금",
    content: [
      "눈꽃치즈돈까스",
      "가쓰오장국",
      "카레덮밥",
      "꼬들단무지",
      "배추김치",
      "콘샐러드",
    ],
  },
];

let dinner_total = [
  {
    date: "27",
    day: "월",
    content: [
      "돈육고추장볶음",
      "들깨미역국",
      "고로케",
      "어묵조림",
      "부추겉절이",
      "포기김치",
    ],
  },
  {
    date: "28",
    day: "화",
    content: ["탄탄면", "치킨텐더샐러드", "꼬들단무지", "포기김치", "붕어빵"],
  },
  {
    date: "29",
    day: "수",
    content: [
      "돼지국밥&소면",
      "메밀전병",
      "견과류멸치볶음",
      "고추쌈장무침",
      "깐마늘장아찌",
      "깍두기",
    ],
  },
  {
    date: "30",
    day: " 목",
    content: [
      "생선가스",
      "시래기국",
      "쫄면야채무침",
      "고추쌈장무침",
      "땅콩조림",
      "포기김치",
      "사과유자샐러드",
    ],
  },
  {
    date: "31",
    day: "금",
    content: [
      "뚝배기불고기",
      "두부구이&양념장",
      "도라지무침",
      "배추김치",
      "단호박샐러드",
      "미역국",
    ],
  },
];

export {
  restaurant,
  lunch_under,
  dinner_under,
  lunch_E,
  dinner_E,
  lunch_total,
  dinner_total,
};
